In [3]:
# %matplotlib inline
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('imdb_pandas/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [5]:
cast = pd.read_csv('imdb_pandas/cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [12]:
shape = titles.shape[0]

In [14]:
shape

232330

In [17]:
no_null = titles.dropna()

In [18]:
no_null.shape[0]

232329

In [21]:
no_dupes = no_null.drop_duplicates(subset='title', keep='first')

In [22]:
no_dupes.shape[0]

212417

In [23]:
no_dupes

                                       title  year
0                             The Rising Son  1990
1                    The Thousand Plane Raid  1969
2                           Crucea de piatra  1993
3                                    Country  2000
4                                 Gaiking II  2011
...                                      ...   ...
232325                                 E yue  2005
232326                          Lakota Girls  2015
232327                        Kroniki domowe  1997
232328                  Awakening the Zodiac  2017
232329  Death in the Valley of Good and Evil  2018

[212417 rows x 2 columns]

### What are the earliest two films listed in the titles dataframe?

In [26]:
no_dupes.sort_values(by='year').head(2)

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [30]:
hamlet_count = no_dupes[no_dupes['title'].str.contains('Hamlet')]

hamlet_count

                                          title  year
4394            Dogg's Hamlet, Cahoot's Macbeth  2005
6009                                     Hamlet  1948
7670                  Hamlet: Prince of Denmark  1989
8582                                Hamlet (II)  2005
14317                     Green Eggs and Hamlet  1995
15183                            Hamlet Unbound  2012
15202             Hamlet: The Fall of a Sparrow  2017
17419                 Hamlet, Prince of Denmark  1997
24178                        Han, hun og Hamlet  1932
24284               Intikam Melegi/Kadin Hamlet  1976
37146                                  Hamlet_X  2003
39230                  Hamlet, Son of a Kingpin  2015
42266                               Hamlet (IV)  2016
44682                              Hamlet (III)  2007
62549                            Redneck Hamlet  2017
71152   The Tragedy of Hamlet Prince of Denmark  2007
72925                        A Sagebrush Hamlet  1919
83789                       Harry, Hamlet and I  2013
98086                                  Hamlet 2  2008
102506      Predstava 'Hamleta' u Mrdusi Donjoj  1974
109367                            Hamlet Frezer  2016
114431                   Hamlet liikemaailmassa  1987
143184                            Hamlet A.D.D.  2014
151918                              Fuck Hamlet  1996
167861                            Zombie Hamlet  2012
172418                Hamlet the Vampire Slayer  2008
174293                                 Hamlet X  2004
192443                             H for Hamlet  1993
193914        Royal Shakespeare Company: Hamlet  2016
195089                           Hamlet's Ghost  2015
211393                           Kitchen Hamlet  2009
223618                   Hamlet in the Hamptons  2002

### How many movies are titled "North by Northwest"?

In [31]:
north = no_dupes[no_dupes['title'].str.contains('North by Northwest')]
north

                     title  year
139311  North by Northwest  1959

### When was the first movie titled "Hamlet" made?

In [32]:
hamlet_count.sort_values(by='year').head(2)

                    title  year
72925  A Sagebrush Hamlet  1919
24178  Han, hun og Hamlet  1932

### List all of the "Treasure Island" movies from earliest to most recent.

In [34]:
treasure_island = no_dupes[no_dupes['title'].str.contains('Treasure Island')]
treasure_island.sort_values(by='year')

                                                    title  year
51287                                     Treasure Island  1920
144440                      The Secret of Treasure Island  1938
59773                     Charlie Chan at Treasure Island  1939
187404                          Return to Treasure Island  1954
65156                           Five on a Treasure Island  1957
130842                             Muppet Treasure Island  1996
153428                               Treasure Island (II)  1999
28183                          Pirates of Treasure Island  2006
180487  Treasure Island Kids: The Mystery of Treasure ...  2006
217992  Treasure Island Kids: The Battle of Treasure I...  2006
223604  Treasure Island Kids: The Monster of Treasure ...  2006
191707             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

In [41]:
movies_1050 = titles[titles['year'] == 1950]

In [43]:
movies_1050.count()

title    1099
year     1099
dtype: int64

### How many movies were made in the year 1960?

### How many movies were made from 1950 through 1959?

In [49]:
through_50_59 = titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)]

through_50_59.count()

title    12711
year     12711
dtype: int64

In [51]:
through_50_59.sort_values(by='year')

                            title  year
159576        Stranger at My Door  1950
74760              Atto di accusa  1950
74802                      Crisis  1950
199353             Bitter Springs  1950
74853     Women from Headquarters  1950
...                           ...   ...
205321            Annemi ariyorum  1959
49809                    Le bossu  1959
18317   La vache et le prisonnier  1959
160845                  Ultimatum  1959
38992                   Son yolcu  1959

[12711 rows x 2 columns]

### In what years has a movie titled "Batman" been released?

In [56]:
no_dupes[no_dupes['title'] == 'Batman']

        title  year
56000  Batman  1989

### How many roles were there in the movie "Inception"?

In [60]:
inception = cast[cast['title'] == 'Inception']

inception.count()

title        77
year         77
name         77
type         77
character    77
n            51
dtype: int64

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [68]:
inception.isna().sum()

title         0
year          0
name          0
type          0
character     0
n            26
dtype: int64

### But how many roles in the movie "Inception" did receive an "n" value?

In [71]:
inception.count()

title        77
year         77
name         77
type         77
character    77
n            51
dtype: int64

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [72]:
north_cast = cast[cast['title'] == 'North by Northwest']

In [78]:
north_sorted = north_cast.sort_values(by='n')

In [79]:
north_sorted[north_sorted['n'].notnull()]

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?